adbik4/embedded-vehicle-telemetry/embedded-vehicle-telemetry.ioc
#MicroXplorer Configuration settings - do not modify
BSP_IP_NAME=NUCLEO-U3C5ZI-Q
CAD.formats=
CAD.pinconfig=
CAD.provider=
CORTEX_M33_NS.userName=CORTEX_M33
File.Version=6
GPDMA1.CIRCULARMODE_GPDMACH0=ENABLE
GPDMA1.DESTINC_GPDMACH0=DMA_DINC_INCREMENTED
GPDMA1.IPHANDLE_GPDMACH0-SIMPLEREQUEST_GPDMACH0=__NULL
GPDMA1.IPParameters=DESTINC_GPDMACH0,IPHANDLE_GPDMACH0-SIMPLEREQUEST_GPDMACH0,REQUEST_GPDMACH0,CIRCULARMODE_GPDMACH0,PRIORITY_LL_CIRCULAR_GPDMACH0
GPDMA1.PRIORITY_LL_CIRCULAR_GPDMACH0=DMA_LOW_PRIORITY_MID_WEIGHT
GPDMA1.REQUEST_GPDMACH0=GPDMA1_REQUEST_USART3_RX
GPIO.groupedBy=Group By Peripherals
I2C3.I2C_Speed_Mode=I2C_Fast
I2C3.IPParameters=Timing,I2C_Speed_Mode,OwnAddress
I2C3.OwnAddress=0
I2C3.Timing=0x009032AE
KeepUserPlacement=true
Mcu.CPN=STM32U3C5ZITxQ
Mcu.ContextProject=TrustZoneDisabled
Mcu.Family=STM32U3
Mcu.IP0=CORTEX_M33_NS
Mcu.IP1=CRC
Mcu.IP10=SPI3
Mcu.IP11=SYS
Mcu.IP12=TIM1
Mcu.IP13=TIM4
Mcu.IP14=UART4
Mcu.IP15=USART3
Mcu.IP2=GPDMA1
Mcu.IP3=I2C3
Mcu.IP4=NUCLEO-U3C5ZI-Q
Mcu.IP5=NVIC
Mcu.IP6=PWR
Mcu.IP7=RCC
Mcu.IP8=RTC
Mcu.IP9=SPI2
Mcu.IPNb=17
Mcu.Name=STM32U3C5ZITxQ
Mcu.Package=LQFP144
Mcu.Pin0=PE2
Mcu.Pin1=PE3
Mcu.Pin10=PH0-OSC_IN (PH0)
Mcu.Pin11=PH1-OSC_OUT (PH1)
Mcu.Pin12=PC0
Mcu.Pin13=PC1
Mcu.Pin14=PC2
Mcu.Pin15=PC3
Mcu.Pin16=PA0
Mcu.Pin17=PA1
Mcu.Pin18=PA2
Mcu.Pin19=PA3
Mcu.Pin2=PE4
Mcu.Pin20=PA4
Mcu.Pin21=PA5
Mcu.Pin22=PA6
Mcu.Pin23=PA7
Mcu.Pin24=PB0
Mcu.Pin25=PB1
Mcu.Pin26=PF12
Mcu.Pin27=PE14
Mcu.Pin28=PB10
Mcu.Pin29=PD13
Mcu.Pin3=PE5
Mcu.Pin30=PA9
Mcu.Pin31=PA10
Mcu.Pin32=PA11
Mcu.Pin33=PA12
Mcu.Pin34=PA13 (JTMS/SWDIO)
Mcu.Pin35=PA14 (JTCK/SWCLK)
Mcu.Pin36=PA15 (JTDI)
Mcu.Pin37=PC10
Mcu.Pin38=PC11
Mcu.Pin39=PC12
Mcu.Pin4=PE6
Mcu.Pin40=PD2
Mcu.Pin41=PD7
Mcu.Pin42=PB3 (JTDO/TRACESWO)
Mcu.Pin43=VP_CORTEX_M33_NS_VS_Hclk
Mcu.Pin44=VP_CRC_VS_CRC
Mcu.Pin45=VP_GPDMA1_VS_GPDMACH0
Mcu.Pin46=VP_PWR_VS_SECSignals
Mcu.Pin47=VP_PWR_VS_DBSignals
Mcu.Pin48=VP_RTC_VS_RTC_Activate
Mcu.Pin49=VP_RTC_VS_RTC_Calendar
Mcu.Pin5=PC13
Mcu.Pin50=VP_SYS_VS_Systick
Mcu.Pin51=VP_TIM1_VS_ClockSourceINT
Mcu.Pin52=VP_TIM4_VS_ClockSourceINT
Mcu.Pin53=VP_STMicroelectronics.X-CUBE-MEMS1_VS_BoardOoPartJjMag_5.7.0_13.0.0
Mcu.Pin54=VP_STMicroelectronics.X-CUBE-MEMS1_VS_BoardOoPartJjAccGyrQvar_1.9.0_13.0.0
Mcu.Pin55=VP_STMicroelectronics.X-CUBE-MEMS1_VS_BoardOoSupportJjCustom_13.0.0_13.0.0
Mcu.Pin56=VP_STMicroelectronics.X-CUBE-MEMS1_VS_SensorsJjSTM32IiMotionFXIiLibrary_2.10.0_13.0.0
Mcu.Pin57=VP_STMicroelectronics.X-CUBE-ALGOBUILD_VS_DeviceJjApplication_1.5.0_1.5.0
Mcu.Pin58=VP_STMicroelectronics.X-CUBE-ALGOBUILD_VS_MotionOoLibrariesJjLibrary_1.5.0_1.5.0
Mcu.Pin59=VP_STMicroelectronics.X-CUBE-ALGOBUILD_VS_DSPOoLibraryJjLibrary_1.5.0_1.5.0
Mcu.Pin6=PC14-OSC32_IN (PC14)
Mcu.Pin60=VP_NUCLEO-U3C5ZI-Q_VS_BSP_COMMON
Mcu.Pin7=PC15-OSC32_OUT (PC15)
Mcu.Pin8=PF7
Mcu.Pin9=PF8
Mcu.PinsNb=61
Mcu.ThirdParty0=STMicroelectronics.X-CUBE-ALGOBUILD.1.5.0
Mcu.ThirdParty1=STMicroelectronics.X-CUBE-MEMS1.13.0.0
Mcu.ThirdPartyNb=2
Mcu.UserConstants=
Mcu.UserName=STM32U3C5ZITxQ
MxCube.Version=6.18.0
MxDb.Version=DB.6.0.180
NUCLEO-U3C5ZI-Q.BUTTON=0
NUCLEO-U3C5ZI-Q.IPParameters=LD3,LD1,LD2,VCP,BUTTON
NUCLEO-U3C5ZI-Q.LD1=false
NUCLEO-U3C5ZI-Q.LD2=true
NUCLEO-U3C5ZI-Q.LD3=false
NUCLEO-U3C5ZI-Q.VCP=true
NVIC.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.EXTI13_IRQn=true\:0\:0\:false\:false\:true\:true\:true\:true
NVIC.EXTI3_IRQn=true\:0\:0\:false\:false\:true\:true\:true\:true
NVIC.ForceEnableDMAVector=false
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.PriorityGroup=NVIC_PRIORITYGROUP_4
NVIC.SVCall_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.SecureFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.SysTick_IRQn=true\:15\:0\:true\:false\:true\:false\:true\:false
NVIC.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
PA0.Mode=Asynchronous
PA0.Signal=UART4_TX
PA1.Mode=Asynchronous
PA1.Signal=UART4_RX
PA10.Locked=true
PA10.Signal=USART1_RX
PA11.GPIOParameters=GPIO_Label
PA11.GPIO_Label=USB_DM
PA11.Locked=true
PA11.Signal=USB_DM
PA12.GPIOParameters=GPIO_Label
PA12.GPIO_Label=USB_DP
PA12.Locked=true
PA12.Signal=USB_DP
PA13\ (JTMS/SWDIO).GPIOParameters=GPIO_Label
PA13\ (JTMS/SWDIO).GPIO_Label=DEBUG_JTMS-SWDIO
PA13\ (JTMS/SWDIO).Locked=true
PA13\ (JTMS/SWDIO).Signal=DEBUG_JTMS-SWDIO
PA14\ (JTCK/SWCLK).GPIOParameters=GPIO_Label
PA14\ (JTCK/SWCLK).GPIO_Label=DEBUG_JTCK-SWCLK
PA14\ (JTCK/SWCLK).Locked=true
PA14\ (JTCK/SWCLK).Signal=DEBUG_JTCK-SWCLK
PA15\ (JTDI).GPIOParameters=GPIO_Label
PA15\ (JTDI).GPIO_Label=DEBUG_JTDI
PA15\ (JTDI).Locked=true
PA15\ (JTDI).Signal=DEBUG_JTDI
PA2.Locked=true
PA2.Signal=GPIO_Output
PA3.Locked=true
PA3.Signal=GPIO_Input
PA4.Locked=true
PA4.Signal=GPIO_Output
PA5.GPIOParameters=GPIO_Label
PA5.GPIO_Label=DEBUG_USART_RX
PA5.Locked=true
PA5.Mode=Asynchronous
PA5.Signal=USART3_RX
PA6.Locked=true
PA6.Signal=GPIO_Output
PA7.GPIOParameters=GPIO_Label
PA7.GPIO_Label=DEBUG_USART_TX
PA7.Mode=Asynchronous
PA7.Signal=USART3_TX
PA9.Locked=true
PA9.Signal=USART1_TX
PB0.Locked=true
PB0.Signal=GPIO_Output
PB1.Locked=true
PB1.Signal=GPIO_Input
PB10.Mode=TX_Only_Simplex_Unidirect_Master
PB10.Signal=SPI2_SCK
PB3\ (JTDO/TRACESWO).GPIOParameters=GPIO_Label
PB3\ (JTDO/TRACESWO).GPIO_Label=DEBUG_JTDO-SWO
PB3\ (JTDO/TRACESWO).Locked=true
PB3\ (JTDO/TRACESWO).Signal=DEBUG_JTDO-SWO
PC0.Mode=I2C
PC0.Signal=I2C3_SCL
PC1.Mode=TX_Only_Simplex_Unidirect_Master
PC1.Signal=SPI2_MOSI
PC10.Mode=Full_Duplex_Master
PC10.Signal=SPI3_SCK
PC11.Mode=Full_Duplex_Master
PC11.Signal=SPI3_MISO
PC12.Mode=Full_Duplex_Master
PC12.Signal=SPI3_MOSI
PC13.GPIOParameters=GPIO_Label
PC13.GPIO_Label=BUTTON_KEY
PC13.Locked=true
PC13.Signal=GPXTI13
PC14-OSC32_IN\ (PC14).GPIOParameters=GPIO_Label
PC14-OSC32_IN\ (PC14).GPIO_Label=RCC_OSC32_IN
PC14-OSC32_IN\ (PC14).Locked=true
PC14-OSC32_IN\ (PC14).Signal=RCC_OSC32_IN
PC15-OSC32_OUT\ (PC15).GPIOParameters=GPIO_Label
PC15-OSC32_OUT\ (PC15).GPIO_Label=RCC_OSC32_OUT
PC15-OSC32_OUT\ (PC15).Locked=true
PC15-OSC32_OUT\ (PC15).Signal=RCC_OSC32_OUT
PC2.GPIOParameters=GPIO_Label
PC2.GPIO_Label=VSENSE(ADC2_IN1)
PC2.Locked=true
PC2.Signal=ADC2_IN1
PC3.GPIOParameters=GPIO_Label
PC3.GPIO_Label=ACCEL_GYRO_INT
PC3.Locked=true
PC3.Signal=GPXTI3
PD13.Mode=I2C
PD13.Signal=I2C3_SDA
PD2.GPIOParameters=GPIO_Label
PD2.GPIO_Label=MAG_CS
PD2.Locked=true
PD2.Signal=GPIO_Output
PD7.GPIOParameters=GPIO_Label
PD7.GPIO_Label=FDCAN_STBY
PD7.Locked=true
PD7.Signal=GPIO_Output
PE14.GPIOParameters=GPIO_Label
PE14.GPIO_Label=LED2
PE14.Locked=true
PE14.Signal=GPIO_Output
PE2.Locked=true
PE2.Signal=DEBUG_TRACECLK
PE3.Locked=true
PE3.Signal=DEBUG_TRACED0
PE4.Locked=true
PE4.Signal=DEBUG_TRACED1
PE5.Locked=true
PE5.Signal=DEBUG_TRACED2
PE6.Locked=true
PE6.Signal=DEBUG_TRACED3
PF12.GPIOParameters=GPIO_Label
PF12.GPIO_Label=VBUS_DET
PF12.Locked=true
PF12.Signal=GPIO_Input
PF7.Locked=true
PF7.Signal=FDCAN1_RX
PF8.Locked=true
PF8.Signal=FDCAN1_TX
PH0-OSC_IN\ (PH0).Locked=true
PH0-OSC_IN\ (PH0).Signal=RCC_OSC_IN
PH1-OSC_OUT\ (PH1).Locked=true
PH1-OSC_OUT\ (PH1).Signal=RCC_OSC_OUT
PinOutPanel.RotationAngle=0
ProjectManager.AskForMigrate=true
ProjectManager.BackupPrevious=false
ProjectManager.CompilerLinker=GCC
ProjectManager.CompilerOptimize=6
ProjectManager.ComputerToolchain=false
ProjectManager.CoupleFile=false
ProjectManager.CustomerFirmwarePackage=
ProjectManager.DefaultFWLocation=true
ProjectManager.DeletePrevious=true
ProjectManager.DeviceId=STM32U3C5ZITxQ
ProjectManager.FirmwarePackage=STM32Cube FW_U3 V1.4.0
ProjectManager.FreePins=false
ProjectManager.FreePinsContext=
ProjectManager.HalAssertFull=false
ProjectManager.HeapSize=0xB090
ProjectManager.KeepUserCode=true
ProjectManager.LastFirmware=true
ProjectManager.LibraryCopy=1
ProjectManager.MainLocation=Core/Src
ProjectManager.NoMain=false
ProjectManager.PreviousToolchain=
ProjectManager.ProjectBuild=false
ProjectManager.ProjectFileName=embedded-vehicle-telemetry.ioc
ProjectManager.ProjectName=embedded-vehicle-telemetry
ProjectManager.ProjectStructure=
ProjectManager.RegisterCallBack=
ProjectManager.StackSize=0x7DE0
ProjectManager.TargetToolchain=CMake
ProjectManager.ToolChainLocation=
ProjectManager.UAScriptAfterPath=
ProjectManager.UAScriptBeforePath=
ProjectManager.UnderRoot=false
ProjectManager.functionlistsort=1-SystemClock_Config-RCC-false-HAL-false,2-MX_GPIO_Init-GPIO-false-HAL-true,3-MX_GPDMA1_Init-GPDMA1-false-HAL-true,4-MX_SPI2_Init-SPI2-false-HAL-true,5-MX_CRC_Init-CRC-false-HAL-true,6-MX_UART4_Init-UART4-false-HAL-true,7-MX_RTC_Init-RTC-false-HAL-true,8-MX_TIM1_Init-TIM1-true-HAL-false,9-MX_TIM4_Init-TIM4-true-HAL-false,13-MX_Library_Init-STMicroelectronics.X-CUBE-ALGOBUILD.1.5.0-false-HAL-false,0-MX_PWR_Init-PWR-false-HAL-true,0-MX_CORTEX_M33_NS_Init-CORTEX_M33_NS-false-HAL-true,false-0--NUCLEO-U3C5ZI-Q-true-HAL-true,14-MX_Library_Process-STMicroelectronics.X-CUBE-ALGOBUILD.1.5.0-false-HAL-false
RCC.ADCFreq_Value=96000000
RCC.ADF1Freq_Value=96000000
RCC.AHBFreq_Value=96000000
RCC.APB1Freq_Value=96000000
RCC.APB1TimFreq_Value=96000000
RCC.APB2Freq_Value=96000000
RCC.APB2TimFreq_Value=96000000
RCC.APB3Freq_Value=96000000
RCC.CRSFreq_Value=48000000
RCC.CortexFreq_Value=12000000
RCC.DACFreq_Value=32000
RCC.FCLKCortexFreq_Value=96000000
RCC.FDCANFreq_Value=96000000
RCC.FamilyName=M
RCC.HCLKFreq_Value=96000000
RCC.HSE_Timout=100
RCC.HSE_VALUE=8000000
RCC.HSI48_VALUE=48000000
RCC.HSI_VALUE=16000000
RCC.I2C1Freq_Value=96000000
RCC.I2C2Freq_Value=96000000
RCC.I2C3Freq_Value=96000000
RCC.I2C4Freq_Value=96000000
RCC.I3C1Freq_Value=96000000
RCC.I3C2Freq_Value=96000000
RCC.IPParameters=ADCFreq_Value,ADF1Freq_Value,AHBFreq_Value,APB1Freq_Value,APB1TimFreq_Value,APB2Freq_Value,APB2TimFreq_Value,APB3Freq_Value,CRSFreq_Value,CortexFreq_Value,DACFreq_Value,FCLKCortexFreq_Value,FDCANFreq_Value,FamilyName,HCLKFreq_Value,HSE_Timout,HSE_VALUE,HSI48_VALUE,HSI_VALUE,I2C1Freq_Value,I2C2Freq_Value,I2C3Freq_Value,I2C4Freq_Value,I3C1Freq_Value,I3C2Freq_Value,LPTIM1Freq_Value,LPTIM2Freq_Value,LPTIM3Freq_Value,LPUART1Freq_Value,LSCOPinFreq_Value,LSE_VALUE,LSIDIV_VALUE,LSI_VALUE,MCO1PinFreq_Value,MCO2PinFreq_Value,MSISDIV,MSISFreq_Value,OCTOSPIMFreq_Value,RNGFreq_Value,SAESFreq_Value,SAI1Freq_Value,SDMMCFreq_Value,SPI1Freq_Value,SPI2Freq_Value,SPI3Freq_Value,SPI4Freq_Value,SYSCLKFreq_VALUE,UART4Freq_Value,UART5Freq_Value,USART1Freq_Value,USART2Freq_Value,USART3Freq_Value,USBFreq_Value,USB_DIV
RCC.LPTIM1Freq_Value=96000000
RCC.LPTIM2Freq_Value=96000000
RCC.LPTIM3Freq_Value=96000000
RCC.LPUART1Freq_Value=96000000
RCC.LSCOPinFreq_Value=32000
RCC.LSE_VALUE=32768
RCC.LSIDIV_VALUE=32000
RCC.LSI_VALUE=32000
RCC.MCO1PinFreq_Value=96000000
RCC.MCO2PinFreq_Value=96000000
RCC.MSISDIV=RCC_MSI_DIV1
RCC.MSISFreq_Value=96000000
RCC.OCTOSPIMFreq_Value=96000000
RCC.RNGFreq_Value=48000000
RCC.SAESFreq_Value=96000000
RCC.SAI1Freq_Value=96000000
RCC.SDMMCFreq_Value=96000000
RCC.SPI1Freq_Value=96000000
RCC.SPI2Freq_Value=96000000
RCC.SPI3Freq_Value=96000000
RCC.SPI4Freq_Value=96000000
RCC.SYSCLKFreq_VALUE=96000000
RCC.UART4Freq_Value=96000000
RCC.UART5Freq_Value=96000000
RCC.USART1Freq_Value=96000000
RCC.USART2Freq_Value=96000000
RCC.USART3Freq_Value=96000000
RCC.USBFreq_Value=48000000
RCC.USB_DIV=RCC_USB1CLKSOURCE_ICLK_DIV2
SH.GPXTI13.0=GPIO_EXTI13
SH.GPXTI13.ConfNb=1
SH.GPXTI3.0=GPIO_EXTI3
SH.GPXTI3.ConfNb=1
SPI2.BaudRatePrescaler=SPI_BAUDRATEPRESCALER_32
SPI2.CalculateBaudRate=3.0 MBits/s
SPI2.DataSize=SPI_DATASIZE_8BIT
SPI2.Direction=SPI_DIRECTION_2LINES_TXONLY
SPI2.IPParameters=VirtualType,Mode,Direction,CalculateBaudRate,DataSize,BaudRatePrescaler
SPI2.Mode=SPI_MODE_MASTER
SPI2.VirtualType=VM_MASTER
SPI3.BaudRatePrescaler=SPI_BAUDRATEPRESCALER_64
SPI3.CalculateBaudRate=1.5 MBits/s
SPI3.Direction=SPI_DIRECTION_2LINES
SPI3.IPParameters=VirtualType,Mode,Direction,CalculateBaudRate,BaudRatePrescaler
SPI3.Mode=SPI_MODE_MASTER
SPI3.VirtualType=VM_MASTER
STMicroelectronics.X-CUBE-ALGOBUILD.1.5.0.ApplicationCcDeviceJjApplication=CUSTOMIiAlgoBuilderIiTemplate
STMicroelectronics.X-CUBE-ALGOBUILD.1.5.0.BSP.number=6
STMicroelectronics.X-CUBE-ALGOBUILD.1.5.0.DSPOoLibraryJjLibrary_Checked=true
STMicroelectronics.X-CUBE-ALGOBUILD.1.5.0.DeviceJjApplication_Checked=true
STMicroelectronics.X-CUBE-ALGOBUILD.1.5.0.IPParameters=LibraryCcMotionOoLibrariesJjMotionOoLibraries,LibraryCcDSPOoLibraryJjDSPOoLibrary,ApplicationCcDeviceJjApplication
STMicroelectronics.X-CUBE-ALGOBUILD.1.5.0.LibraryCcDSPOoLibraryJjDSPOoLibrary=true
STMicroelectronics.X-CUBE-ALGOBUILD.1.5.0.LibraryCcMotionOoLibrariesJjMotionOoLibraries=true
STMicroelectronics.X-CUBE-ALGOBUILD.1.5.0.MotionOoLibrariesJjLibrary_Checked=true
STMicroelectronics.X-CUBE-ALGOBUILD.1.5.00.BSP.STBoard=false
STMicroelectronics.X-CUBE-ALGOBUILD.1.5.00.BSP.api=Unknown
STMicroelectronics.X-CUBE-ALGOBUILD.1.5.00.BSP.component=
STMicroelectronics.X-CUBE-ALGOBUILD.1.5.00.BSP.condition=
STMicroelectronics.X-CUBE-ALGOBUILD.1.5.00.BSP.instance=TIM1
STMicroelectronics.X-CUBE-ALGOBUILD.1.5.00.BSP.ip=TIM.*
STMicroelectronics.X-CUBE-ALGOBUILD.1.5.00.BSP.mode=Internal Clock
STMicroelectronics.X-CUBE-ALGOBUILD.1.5.00.BSP.name=TIMER2
STMicroelectronics.X-CUBE-ALGOBUILD.1.5.00.BSP.semaphore=
STMicroelectronics.X-CUBE-ALGOBUILD.1.5.00.BSP.solution=TIM1
STMicroelectronics.X-CUBE-ALGOBUILD.1.5.01.BSP.STBoard=false
STMicroelectronics.X-CUBE-ALGOBUILD.1.5.01.BSP.api=Unknown
STMicroelectronics.X-CUBE-ALGOBUILD.1.5.01.BSP.component=
STMicroelectronics.X-CUBE-ALGOBUILD.1.5.01.BSP.condition=
STMicroelectronics.X-CUBE-ALGOBUILD.1.5.01.BSP.instance=TIM4
STMicroelectronics.X-CUBE-ALGOBUILD.1.5.01.BSP.ip=TIM.*
STMicroelectronics.X-CUBE-ALGOBUILD.1.5.01.BSP.mode=Internal Clock
STMicroelectronics.X-CUBE-ALGOBUILD.1.5.01.BSP.name=TIMER1
STMicroelectronics.X-CUBE-ALGOBUILD.1.5.01.BSP.semaphore=
STMicroelectronics.X-CUBE-ALGOBUILD.1.5.01.BSP.solution=TIM4
STMicroelectronics.X-CUBE-ALGOBUILD.1.5.02.BSP.STBoard=false
STMicroelectronics.X-CUBE-ALGOBUILD.1.5.02.BSP.api=BSP_COMMON_DRIVER
STMicroelectronics.X-CUBE-ALGOBUILD.1.5.02.BSP.component=
STMicroelectronics.X-CUBE-ALGOBUILD.1.5.02.BSP.condition=
STMicroelectronics.X-CUBE-ALGOBUILD.1.5.02.BSP.instance=PC13
STMicroelectronics.X-CUBE-ALGOBUILD.1.5.02.BSP.ip=GPIO
STMicroelectronics.X-CUBE-ALGOBUILD.1.5.02.BSP.mode=EXTI
STMicroelectronics.X-CUBE-ALGOBUILD.1.5.02.BSP.name=BSP BUTTON
STMicroelectronics.X-CUBE-ALGOBUILD.1.5.02.BSP.semaphore=
STMicroelectronics.X-CUBE-ALGOBUILD.1.5.02.BSP.solution=PC13
STMicroelectronics.X-CUBE-ALGOBUILD.1.5.03.BSP.STBoard=false
STMicroelectronics.X-CUBE-ALGOBUILD.1.5.03.BSP.api=HAL_EXTI_DRIVER
STMicroelectronics.X-CUBE-ALGOBUILD.1.5.03.BSP.component=
STMicroelectronics.X-CUBE-ALGOBUILD.1.5.03.BSP.condition=
STMicroelectronics.X-CUBE-ALGOBUILD.1.5.03.BSP.instance=PC3
STMicroelectronics.X-CUBE-ALGOBUILD.1.5.03.BSP.ip=GPIO
STMicroelectronics.X-CUBE-ALGOBUILD.1.5.03.BSP.mode=EXTI
STMicroelectronics.X-CUBE-ALGOBUILD.1.5.03.BSP.name=MEMS_INT_PIN_A
STMicroelectronics.X-CUBE-ALGOBUILD.1.5.03.BSP.semaphore=
STMicroelectronics.X-CUBE-ALGOBUILD.1.5.03.BSP.solution=PC3
STMicroelectronics.X-CUBE-ALGOBUILD.1.5.04.BSP.STBoard=false
STMicroelectronics.X-CUBE-ALGOBUILD.1.5.04.BSP.api=BSP_COMMON_DRIVER
STMicroelectronics.X-CUBE-ALGOBUILD.1.5.04.BSP.component=
STMicroelectronics.X-CUBE-ALGOBUILD.1.5.04.BSP.condition=
STMicroelectronics.X-CUBE-ALGOBUILD.1.5.04.BSP.instance=USART3
STMicroelectronics.X-CUBE-ALGOBUILD.1.5.04.BSP.ip=(LPU|US)ART
STMicroelectronics.X-CUBE-ALGOBUILD.1.5.04.BSP.mode=Asynchronous
STMicroelectronics.X-CUBE-ALGOBUILD.1.5.04.BSP.name=BSP USART
STMicroelectronics.X-CUBE-ALGOBUILD.1.5.04.BSP.semaphore=
STMicroelectronics.X-CUBE-ALGOBUILD.1.5.04.BSP.solution=USART3
STMicroelectronics.X-CUBE-ALGOBUILD.1.5.05.BSP.STBoard=false
STMicroelectronics.X-CUBE-ALGOBUILD.1.5.05.BSP.api=BSP_COMMON_DRIVER
STMicroelectronics.X-CUBE-ALGOBUILD.1.5.05.BSP.component=
STMicroelectronics.X-CUBE-ALGOBUILD.1.5.05.BSP.condition=
STMicroelectronics.X-CUBE-ALGOBUILD.1.5.05.BSP.instance=PE14
STMicroelectronics.X-CUBE-ALGOBUILD.1.5.05.BSP.ip=GPIO
STMicroelectronics.X-CUBE-ALGOBUILD.1.5.05.BSP.mode=Output
STMicroelectronics.X-CUBE-ALGOBUILD.1.5.05.BSP.name=BSP LED
STMicroelectronics.X-CUBE-ALGOBUILD.1.5.05.BSP.semaphore=
STMicroelectronics.X-CUBE-ALGOBUILD.1.5.05.BSP.solution=PE14
STMicroelectronics.X-CUBE-ALGOBUILD.1.5.0_SwParameter=LibraryCcDSPOoLibraryJjDSPOoLibrary\:true;LibraryCcMotionOoLibrariesJjMotionOoLibraries\:true;ApplicationCcDeviceJjApplication\:CUSTOMIiAlgoBuilderIiTemplate;
STMicroelectronics.X-CUBE-MEMS1.13.0.0.BSP.number=3
STMicroelectronics.X-CUBE-MEMS1.13.0.0.BoardOoPartJjAccGyrQvarJjLSM6DSV16X=I2C
STMicroelectronics.X-CUBE-MEMS1.13.0.0.BoardOoPartJjAccGyrQvar_Checked=true
STMicroelectronics.X-CUBE-MEMS1.13.0.0.BoardOoPartJjMagJjLIS2MDL=SPI
STMicroelectronics.X-CUBE-MEMS1.13.0.0.BoardOoPartJjMag_Checked=true
STMicroelectronics.X-CUBE-MEMS1.13.0.0.BoardOoSupportJjCustomJjMOTIONIiSENSOR=true
STMicroelectronics.X-CUBE-MEMS1.13.0.0.BoardOoSupportJjCustom_Checked=true
STMicroelectronics.X-CUBE-MEMS1.13.0.0.IPParameters=BoardOoSupportJjCustomJjMOTIONIiSENSOR,SensorsJjSTM32IiMotionFXIiLibraryJjCore,BoardOoPartJjMagJjLIS2MDL,BoardOoPartJjAccGyrQvarJjLSM6DSV16X
STMicroelectronics.X-CUBE-MEMS1.13.0.0.SensorsJjSTM32IiMotionFXIiLibraryJjCore=true
STMicroelectronics.X-CUBE-MEMS1.13.0.0.SensorsJjSTM32IiMotionFXIiLibrary_Checked=true
STMicroelectronics.X-CUBE-MEMS1.13.0.00.BSP.STBoard=false
STMicroelectronics.X-CUBE-MEMS1.13.0.00.BSP.api=BSP_BUS_DRIVER
STMicroelectronics.X-CUBE-MEMS1.13.0.00.BSP.component=
STMicroelectronics.X-CUBE-MEMS1.13.0.00.BSP.condition=SEMBoardOoPartJjAccGyrQvarJjLSM6DSV16XJjI2C
STMicroelectronics.X-CUBE-MEMS1.13.0.00.BSP.instance=I2C3
STMicroelectronics.X-CUBE-MEMS1.13.0.00.BSP.ip=I2C
