adbik4/embedded-vehicle-telemetry/embedded-vehicle-telemetry.ioc
STMicroelectronics.X-CUBE-MEMS1.13.0.00.BSP.mode=I2C
STMicroelectronics.X-CUBE-MEMS1.13.0.00.BSP.name=LSM6DSV16X BUS IO driver
STMicroelectronics.X-CUBE-MEMS1.13.0.00.BSP.semaphore=
STMicroelectronics.X-CUBE-MEMS1.13.0.00.BSP.solution=I2C3
STMicroelectronics.X-CUBE-MEMS1.13.0.01.BSP.STBoard=false
STMicroelectronics.X-CUBE-MEMS1.13.0.01.BSP.api=BSP_BUS_DRIVER
STMicroelectronics.X-CUBE-MEMS1.13.0.01.BSP.component=
STMicroelectronics.X-CUBE-MEMS1.13.0.01.BSP.condition=SEMBoardOoPartJjMagJjLIS2MDLJjSPI
STMicroelectronics.X-CUBE-MEMS1.13.0.01.BSP.instance=SPI3
STMicroelectronics.X-CUBE-MEMS1.13.0.01.BSP.ip=SPI
STMicroelectronics.X-CUBE-MEMS1.13.0.01.BSP.mode=Full-Duplex Master
STMicroelectronics.X-CUBE-MEMS1.13.0.01.BSP.name=LIS2MDL BUS IO driver
STMicroelectronics.X-CUBE-MEMS1.13.0.01.BSP.semaphore=
STMicroelectronics.X-CUBE-MEMS1.13.0.01.BSP.solution=SPI3
STMicroelectronics.X-CUBE-MEMS1.13.0.02.BSP.STBoard=false
STMicroelectronics.X-CUBE-MEMS1.13.0.02.BSP.api=Unknown
STMicroelectronics.X-CUBE-MEMS1.13.0.02.BSP.component=
STMicroelectronics.X-CUBE-MEMS1.13.0.02.BSP.condition=SEMBoardOoPartJjMagJjLIS2MDLJjSPI
STMicroelectronics.X-CUBE-MEMS1.13.0.02.BSP.instance=PD2
STMicroelectronics.X-CUBE-MEMS1.13.0.02.BSP.ip=GPIO
STMicroelectronics.X-CUBE-MEMS1.13.0.02.BSP.mode=Output
STMicroelectronics.X-CUBE-MEMS1.13.0.02.BSP.name=LIS2MDL_CS
STMicroelectronics.X-CUBE-MEMS1.13.0.02.BSP.semaphore=
STMicroelectronics.X-CUBE-MEMS1.13.0.02.BSP.solution=PD2
STMicroelectronics.X-CUBE-MEMS1.13.0.0_SwParameter=BoardOoPartJjAccGyrQvarJjLSM6DSV16X\:I2C;BoardOoPartJjMagJjLIS2MDL\:SPI;BoardOoSupportJjCustomJjMOTIONIiSENSOR\:true;SensorsJjSTM32IiMotionFXIiLibraryJjCore\:true;
USART3.IPParameters=VirtualMode-Asynchronous,WordLength
USART3.VirtualMode-Asynchronous=VM_ASYNC
USART3.WordLength=WORDLENGTH_8B
VP_CORTEX_M33_NS_VS_Hclk.Mode=Hclk_Mode
VP_CORTEX_M33_NS_VS_Hclk.Signal=CORTEX_M33_NS_VS_Hclk
VP_CRC_VS_CRC.Mode=CRC_Activate
VP_CRC_VS_CRC.Signal=CRC_VS_CRC
VP_GPDMA1_VS_GPDMACH0.Mode=SIMPLEREQUEST_GPDMACH0
VP_GPDMA1_VS_GPDMACH0.Signal=GPDMA1_VS_GPDMACH0
VP_NUCLEO-U3C5ZI-Q_VS_BSP_COMMON.Mode=COMMON
VP_NUCLEO-U3C5ZI-Q_VS_BSP_COMMON.Signal=NUCLEO-U3C5ZI-Q_VS_BSP_COMMON
VP_PWR_VS_DBSignals.Mode=DisableDeadBatterySignals
VP_PWR_VS_DBSignals.Signal=PWR_VS_DBSignals
VP_PWR_VS_SECSignals.Mode=Security/Privilege
VP_PWR_VS_SECSignals.Signal=PWR_VS_SECSignals
VP_RTC_VS_RTC_Activate.Mode=RTC_Enabled
VP_RTC_VS_RTC_Activate.Signal=RTC_VS_RTC_Activate
VP_RTC_VS_RTC_Calendar.Mode=RTC_Calendar
VP_RTC_VS_RTC_Calendar.Signal=RTC_VS_RTC_Calendar
VP_STMicroelectronics.X-CUBE-ALGOBUILD_VS_DSPOoLibraryJjLibrary_1.5.0_1.5.0.Mode=DSPOoLibraryJjLibrary
VP_STMicroelectronics.X-CUBE-ALGOBUILD_VS_DSPOoLibraryJjLibrary_1.5.0_1.5.0.Signal=STMicroelectronics.X-CUBE-ALGOBUILD_VS_DSPOoLibraryJjLibrary_1.5.0_1.5.0
VP_STMicroelectronics.X-CUBE-ALGOBUILD_VS_DeviceJjApplication_1.5.0_1.5.0.Mode=DeviceJjApplication
VP_STMicroelectronics.X-CUBE-ALGOBUILD_VS_DeviceJjApplication_1.5.0_1.5.0.Signal=STMicroelectronics.X-CUBE-ALGOBUILD_VS_DeviceJjApplication_1.5.0_1.5.0
VP_STMicroelectronics.X-CUBE-ALGOBUILD_VS_MotionOoLibrariesJjLibrary_1.5.0_1.5.0.Mode=MotionOoLibrariesJjLibrary
VP_STMicroelectronics.X-CUBE-ALGOBUILD_VS_MotionOoLibrariesJjLibrary_1.5.0_1.5.0.Signal=STMicroelectronics.X-CUBE-ALGOBUILD_VS_MotionOoLibrariesJjLibrary_1.5.0_1.5.0
VP_STMicroelectronics.X-CUBE-MEMS1_VS_BoardOoPartJjAccGyrQvar_1.9.0_13.0.0.Mode=BoardOoPartJjAccGyrQvar
VP_STMicroelectronics.X-CUBE-MEMS1_VS_BoardOoPartJjAccGyrQvar_1.9.0_13.0.0.Signal=STMicroelectronics.X-CUBE-MEMS1_VS_BoardOoPartJjAccGyrQvar_1.9.0_13.0.0
VP_STMicroelectronics.X-CUBE-MEMS1_VS_BoardOoPartJjMag_5.7.0_13.0.0.Mode=BoardOoPartJjMag
VP_STMicroelectronics.X-CUBE-MEMS1_VS_BoardOoPartJjMag_5.7.0_13.0.0.Signal=STMicroelectronics.X-CUBE-MEMS1_VS_BoardOoPartJjMag_5.7.0_13.0.0
VP_STMicroelectronics.X-CUBE-MEMS1_VS_BoardOoSupportJjCustom_13.0.0_13.0.0.Mode=BoardOoSupportJjCustom
VP_STMicroelectronics.X-CUBE-MEMS1_VS_BoardOoSupportJjCustom_13.0.0_13.0.0.Signal=STMicroelectronics.X-CUBE-MEMS1_VS_BoardOoSupportJjCustom_13.0.0_13.0.0
VP_STMicroelectronics.X-CUBE-MEMS1_VS_SensorsJjSTM32IiMotionFXIiLibrary_2.10.0_13.0.0.Mode=SensorsJjSTM32IiMotionFXIiLibrary
VP_STMicroelectronics.X-CUBE-MEMS1_VS_SensorsJjSTM32IiMotionFXIiLibrary_2.10.0_13.0.0.Signal=STMicroelectronics.X-CUBE-MEMS1_VS_SensorsJjSTM32IiMotionFXIiLibrary_2.10.0_13.0.0
VP_SYS_VS_Systick.Mode=SysTick
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
VP_TIM1_VS_ClockSourceINT.Mode=Internal
VP_TIM1_VS_ClockSourceINT.Signal=TIM1_VS_ClockSourceINT
VP_TIM4_VS_ClockSourceINT.Mode=Internal
VP_TIM4_VS_ClockSourceINT.Signal=TIM4_VS_ClockSourceINT
board=NUCLEO-U3C5ZI-Q
boardIOC=true
